In [2]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [4]:
a={1:'Khalid',2:'Yasser',3:'Mohammed'}
s=pd.Series(a,dtype=str)
s

1      Khalid
2      Yasser
3    Mohammed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [11]:
s.set_axis([11,12,13],inplace=True)
s

C:\Users\Mo\AppData\Local\Temp\ipykernel_8460\2170708309.py:1: FutureWarning: Series.set_axis 'inplace' keyword is deprecated and will be removed in a future version. Use `obj = obj.set_axis(..., copy=False)` instead
  s.set_axis([11,12,13],inplace=True)

11      Khalid
12      Yasser
13    Mohammed
dtype: object

## Q3: Retrieve First and second elements.

In [17]:
print(s[:2])

11    Khalid
12    Yasser
dtype: object

C:\Users\Mo\AppData\Local\Temp\ipykernel_8460\3285023578.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  print(s[:2])

## Q4: Add duplicate elements, then remove the duplication

In [45]:
s1=pd.Series({11:'Khalid'},dtype=str)
s=pd.concat([s,s1],)

In [46]:
print(s)
s=s.drop_duplicates()
print(s)

11      Khalid
12      Yasser
13    Mohammed
11      Khalid
11      Khalid
11      Khalid
11      Khalid
dtype: object
11      Khalid
12      Yasser
13    Mohammed
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [52]:
data={'ID':[1], 'Name':['Khalid']}
mydataframe=pd.DataFrame(data)
mydataframe

   ID    Name
0   1  Khalid

## Q6: Read educ_figdp_1_Data.csv file

In [54]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [56]:
edu.loc[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e

In [58]:
edu.iloc[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [ ]:
#If the indexes were named differently in the dataframe and we decided to use loc, we would have to have the labels match verbatim with the function call.